In [1]:
import pandas as pd
df = pd.read_csv("bi.csv", encoding="latin1")  
df.to_csv("bi_utf8.csv", index=False, encoding="utf-8")

In [2]:
print(df.head())

       fNAME      lNAME  Age  gender       country  residence  entryEXAM  \
0  Christina     Binger   44  Female        Norway    Private         72
1       Alex   Walekhwa   60       M         Kenya    Private         79
2     Philip        Leo   25    Male        Uganda  Sognsvann         55
3      Shoni  Hlongwane   22       F           Rsa  Sognsvann         40
4      Maria   Kedibone   23  Female  South Africa  Sognsvann         65

  prevEducation  studyHOURS  Python  DB
0       Masters         158    59.0  55
1       Diploma         150    60.0  75
2    HighSchool         130    74.0  50
3   High School         120     NaN  44
4   High School         122    91.0  80

In [23]:
print(df.dtypes)

fNAME             object
lNAME             object
Age                int64
gender            object
country           object
residence         object
entryEXAM          int64
prevEducation     object
studyHOURS         int64
Python           float64
DB                 int64
dtype: object

In [16]:
print(df.columns)

Index(['fNAME', 'lNAME', 'Age', 'gender', 'country', 'residence', 'entryEXAM',
       'prevEducation', 'studyHOURS', 'Python', 'DB'],
      dtype='object')

In [3]:
print (df.shape)

(77, 11)

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 77 entries, 0 to 76
Data columns (total 11 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   fNAME          77 non-null     object
 1   lNAME          77 non-null     object
 2   Age            77 non-null     int64
 3   gender         77 non-null     object
 4   country        77 non-null     object
 5   residence      77 non-null     object
 6   entryEXAM      77 non-null     int64
 7   prevEducation  77 non-null     object
 8   studyHOURS     77 non-null     int64
 9   Python         75 non-null     float64
 10  DB             77 non-null     int64
dtypes: float64(1), int64(4), object(6)
memory usage: 6.7+ KB

In [5]:
df.tail()

,fNAME,lNAME,Age,gender,country,residence,entryEXAM,prevEducation,studyHOURS,Python,DB
72,Clara,Bernard,43,Female,France,Private,80,Bachelors,150,75.0,43
73,Julian,Nielsen,31,Male,Denmark,Sognsvann,90,Masters,158,84.0,83
74,Sophie,Brown,33,Female,UK,Sognsvann,96,Masters,158,85.0,90
75,Leon,Bauer,35,Male,Germany,Sognsvann,90,Masters,160,87.0,74
76,Mohammed,Salim,31,Male,Somali,Sognsvann,35,Masters,144,72.0,90

In [6]:
print(df['gender'].unique())

['Female' 'M' 'Male' 'F' 'female' 'male']

In [7]:
print (df.describe())

             Age  entryEXAM  studyHOURS     Python          DB
count  77.000000  77.000000   77.000000  75.000000   77.000000
mean   35.207792  76.753247  149.714286  75.853333   69.467532
std    10.341966  16.475784   12.743272  15.410328   17.033701
min    21.000000  28.000000  114.000000  15.000000   30.000000
25%    27.000000  69.000000  144.000000  71.000000   56.000000
50%    33.000000  80.000000  156.000000  81.000000   71.000000
75%    42.000000  90.000000  158.000000  85.000000   83.000000
max    71.000000  98.000000  160.000000  91.000000  100.000000

In [10]:
df['gender'] = df['gender'].str.strip().str.lower()
df['gender'] = df['gender'].replace({'m': 'male', 'f': 'female'})
df['gender'] = df['gender'].str.capitalize()
print (df)

        fNAME      lNAME  Age  gender       country  residence  entryEXAM  \
0   Christina     Binger   44  Female        Norway    Private         72
1        Alex   Walekhwa   60    Male         Kenya    Private         79
2      Philip        Leo   25    Male        Uganda  Sognsvann         55
3       Shoni  Hlongwane   22  Female           Rsa  Sognsvann         40
4       Maria   Kedibone   23  Female  South Africa  Sognsvann         65
..        ...        ...  ...     ...           ...        ...        ...
72      Clara    Bernard   43  Female        France    Private         80
73     Julian    Nielsen   31    Male       Denmark  Sognsvann         90
74     Sophie      Brown   33  Female            UK  Sognsvann         96
75       Leon      Bauer   35    Male       Germany  Sognsvann         90
76   Mohammed      Salim   31    Male        Somali  Sognsvann         35

   prevEducation  studyHOURS  Python  DB
0        Masters         158    59.0  55
1        Diploma         150    60.0  75
2     HighSchool         130    74.0  50
3    High School         120     NaN  44
4    High School         122    91.0  80
..           ...         ...     ...  ..
72     Bachelors         150    75.0  43
73       Masters         158    84.0  83
74       Masters         158    85.0  90
75       Masters         160    87.0  74
76       Masters         144    72.0  90

[77 rows x 11 columns]

In [18]:
df['country'].unique()
df['country'] = df['country'].str.strip().str.title()
df['country'] = df['country'].replace({
    'Rsa':'South Africa' ,
    'Norge' : 'Norway',
    'Norway' : 'Norway',
    'norway': 'Norway',
})
print (df)

        fNAME      lNAME  Age  gender       country  residence  entryEXAM  \
0   Christina     Binger   44  Female        Norway    Private         72
1        Alex   Walekhwa   60    Male         Kenya    Private         79
2      Philip        Leo   25    Male        Uganda  Sognsvann         55
3       Shoni  Hlongwane   22  Female  South Africa  Sognsvann         40
4       Maria   Kedibone   23  Female  South Africa  Sognsvann         65
..        ...        ...  ...     ...           ...        ...        ...
72      Clara    Bernard   43  Female        France    Private         80
73     Julian    Nielsen   31    Male       Denmark  Sognsvann         90
74     Sophie      Brown   33  Female            Uk  Sognsvann         96
75       Leon      Bauer   35    Male       Germany  Sognsvann         90
76   Mohammed      Salim   31    Male        Somali  Sognsvann         35

   prevEducation  studyHOURS  Python  DB
0        Masters         158    59.0  55
1        Diploma         150    60.0  75
2     HighSchool         130    74.0  50
3    High School         120     NaN  44
4    High School         122    91.0  80
..           ...         ...     ...  ..
72     Bachelors         150    75.0  43
73       Masters         158    84.0  83
74       Masters         158    85.0  90
75       Masters         160    87.0  74
76       Masters         144    72.0  90

[77 rows x 11 columns]

In [19]:
df['prevEducation'].unique()

array(['Masters', 'Diploma', 'HighSchool', 'High School', 'Bachelors',
       'Barrrchelors', 'diploma', 'DIPLOMA', 'Diplomaaa', 'Doctorate'],
      dtype=object)

In [21]:
df['prevEducation'] = df['prevEducation'].str.strip().str.title()
df['prevEducation'] = df['prevEducation'].replace({
      'Barrrchelors': 'Bachelor',
      'Bachelors': 'Bachelor',
       'Diplomaaa': 'Diploma',
     'Highschool': 'High School',
     'High School': 'High School'})

In [22]:
df['prevEducation'].unique()

array(['Masters', 'Diploma', 'High School', 'Bachelor', 'Doctorate'],
      dtype=object)

In [24]:
df['residence'].unique()

array(['Private', 'Sognsvann', 'BI Residence', 'BI-Residence',
       'BIResidence', 'BI_Residence'], dtype=object)

In [25]:
df['residence'] = df['residence'].str.replace('_', ' ').str.replace('-', ' ')
df['residence'] = df['residence'].str.title()

In [26]:
df['residence'].unique()

array(['Private', 'Sognsvann', 'Bi Residence', 'Biresidence'],
      dtype=object)

In [27]:
 df.duplicated().sum()

np.int64(0)

In [28]:
print(df.isnull().sum())

fNAME            0
lNAME            0
Age              0
gender           0
country          0
residence        0
entryEXAM        0
prevEducation    0
studyHOURS       0
Python           2
DB               0
dtype: int64

In [31]:
df['Python'] = df['Python'].fillna(df['Python'].median())
print (df['Python'])
df['DB'] = df['DB'].fillna(df['DB'].median())
print (df['DB'])

0     59.0
1     60.0
2     74.0
3     81.0
4     91.0
      ...
72    75.0
73    84.0
74    85.0
75    87.0
76    72.0
Name: Python, Length: 77, dtype: float64
0     55
1     75
2     50
3     44
4     80
      ..
72    43
73    83
74    90
75    74
76    90
Name: DB, Length: 77, dtype: int64

In [32]:
df['Python'] = df['Python'].fillna(df['Python'].mean())
print (df['Python'])
df['DB'] = df['DB'].fillna(df['DB'].mean())
print (df['DB'])

0     59.0
1     60.0
2     74.0
3     81.0
4     91.0
      ...
72    75.0
73    84.0
74    85.0
75    87.0
76    72.0
Name: Python, Length: 77, dtype: float64
0     55
1     75
2     50
3     44
4     80
      ..
72    43
73    83
74    90
75    74
76    90
Name: DB, Length: 77, dtype: int64

In [30]:
print(df.isnull().sum())

fNAME            0
lNAME            0
Age              0
gender           0
country          0
residence        0
entryEXAM        0
prevEducation    0
studyHOURS       0
Python           0
DB               0
dtype: int64